spec/dummy/app/controllers/test_events_controller.rb

  def index
    te = TestEvent.create
    best_boy_event te, "test_event", "test_source"
    te.destroy
---
INSERT INTO "test_events" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Tue, 02 Jul 2013 11:00:18 UTC +00:00], ["updated_at", Tue, 02 Jul 2013 11:00:18 UTC +00:00]]
DELETE FROM "test_events" WHERE "test_events"."id" = ?  [["id", 2]]